<a href="https://colab.research.google.com/github/Devan5622/simplelinearregression/blob/master/naivetitanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [23]:
from google.colab import files

uploaded = files.upload()

for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(
      name=fn, length=len(uploaded[fn]))) 
import pandas as pd 
df=pd.read_csv("titanic.csv")
df.head()

Saving titanic.csv to titanic (2).csv
User uploaded file "titanic.csv" with length 61194 bytes

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [24]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [25]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [26]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [27]:
inputs=pd.concat([inputs,dummies], axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [28]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [29]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [30]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [32]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [67]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test=train_test_split(inputs,target,test_size=0.2) 
#Here is 0.2 is used for put the ration b/w train and test data.
#Here 0.2 means test data size will be 20.
#So here we train 80 percent data.

In [68]:
len(X_train)
print("Here Data Ratio=80% ")
print(len(X_train))

Here Data Ratio=80%
712

In [69]:
len(X_test)
print("Here Data Ratio=20% ")
print(len(X_test))

Here Data Ratio=20%
179

In [70]:
len(inputs)
print("Here Total Data:")
print(len(inputs))

Here Total Data:
891

In [71]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [72]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [73]:
model.score(X_test,y_test)

0.8212290502793296

In [74]:
X_test[:10]

     Pclass        Age      Fare  female  male
36        3  29.699118    7.2292       0     1
582       2  54.000000   26.0000       0     1
481       2  29.699118    0.0000       0     1
802       1  11.000000  120.0000       0     1
636       3  32.000000    7.9250       0     1
51        3  21.000000    7.8000       0     1
82        3  29.699118    7.7875       1     0
597       3  49.000000    0.0000       0     1
415       3  29.699118    8.0500       1     0
880       2  25.000000   26.0000       1     0

In [75]:
y_test[:10]

36     1
582    0
481    0
802    1
636    0
51     0
82     1
597    0
415    0
880    1
Name: Survived, dtype: int64

In [76]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 0, 0, 1, 0, 1, 1])

In [77]:
model.predict_proba(X_test[:10])

array([[0.98571681, 0.01428319],
       [0.95823763, 0.04176237],
       [0.97116519, 0.02883481],
       [0.18185979, 0.81814021],
       [0.98594725, 0.01405275],
       [0.98345613, 0.01654387],
       [0.06168526, 0.93831474],
       [0.98345742, 0.01654258],
       [0.06166686, 0.93833314],
       [0.02655426, 0.97344574]])